In [15]:
%load_ext pyensae

The pyensae extension is already loaded. To reload it, use:
  %reload_ext pyensae

In [16]:
%SQL_connect ./databases/slide_example.db

## "Solving" Table Task 1

Step 1

In [4]:
%%SQL
  
SELECT *
FROM Table1
WHERE D > 3

   D  G
0  5  a
1  4  b
2  5  c
3  4  c

## "Solving" Table Task 1

Step 2

In [5]:
%%SQL
    
SELECT *, 2*D AS X
FROM Table1
WHERE D > 3

   D  G   X
0  5  a  10
1  4  b   8
2  5  c  10
3  4  c   8

## "Solving" Table Task 1

Step 3

In [6]:
%%SQL
    
SELECT G, 2*D AS X
FROM Table1
WHERE D > 3

   G   X
0  a  10
1  b   8
2  c  10
3  c   8

## "Solving" Table Task 1

Step 4

In [4]:
%%SQL
    
SELECT upper(G) AS G, 2*D  AS X
FROM Table1
WHERE D > 3

   G   X
0  A  10
1  B   8
2  C  10
3  C   8

## Joining Tables

Inner Join

In [ ]:
%SQL

SELECT *
FROM T1 INNEER JOIN T2 
     ON T1.G1 = T2.G2

## "Solving" Table Task 2

Step 1

In [34]:
%%SQL 
    
SELECT G1, SUM(X) AS X_S
From T1
GROUP BY G1

  G1  X_S
0  a    7
1  b    4

In [35]:
%%SQL 
    
SELECT G2, SUM(Y) AS Y_S
FROM T2
GROUP BY G2

  G2  Y_S
0  a    5
1  b    5
2  c    1

## "Solving" Table Task 2

Step 2

In [13]:
%%SQL
    
    SELECT *
       FROM  
        ((SELECT G1, SUM(X) AS X_S
                  From T1
                  GROUP BY G1) AS A
    INNER JOIN
        (SELECT G2, SUM(Y) AS Y_S
           FROM T2
           GROUP BY G2) AS B
    on A.G1 = B.G2)

  G1  X_S G2  Y_S
0  a    7  a    5
1  b    4  b    5

## "Solving" Table Task 2

Step 3

In [18]:
%%SQL
    
    SELECT G1, X_S, Y_S
       FROM  
        ((SELECT G1, SUM(X) AS X_S
                  From T1
                  GROUP BY G1) AS A
    INNER JOIN
        (SELECT G2, SUM(Y) AS Y_S
           FROM T2
           GROUP BY G2) AS B
    on A.G1 = B.G2)

  G1  X_S  Y_S
0  a    7    5
1  b    4    5